Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase Properties
The PluginWindowBase type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from WindowBase.)
LocExtension
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from WindowBase.)
ShowInTaskbar
 Hides (shadows) the ShowInTaskbar property by setting the property to false.
UseDefaultStyle
 Use default style in all the window controls or not. If the property is not set in the window constructor the default value (true) is used.
 (Inherited from WindowBase.)
Top
See Also
Reference
PluginWindowBase Class
Tekla.Structures.Dialog Namespace